Revit 2027 API
TemporaryGraphicsManager.AddControl Method
 Creates an in-canvas control.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int AddControl(
	InCanvasControlData data,
	ElementId ownerViewId
)
Public Function AddControl (
	data As InCanvasControlData,
	ownerViewId As ElementId
) As Integer
public:
int AddControl(
	InCanvasControlData^ data,
	ElementId^ ownerViewId
)
member AddControl :
        data : InCanvasControlData *
        ownerViewId : ElementId -> int
Parameters
data InCanvasControlData
 Data to generate in-canvas control appearance.
ownerViewId ElementId
 The view in which the control appears. It will show in all views if the id is invalidElementId.
Return Value
Int32
 Unique index of control for future references.
Exceptions
Exception | Condition
ArgumentException |  The ownerViewId provided is not an id of a view.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Failed to load the image from specified path.
Remarks
This method can perform drawing an image (supplied by the caller) as an in-canvas control in the view(s). The control can react on click by invoking a callback defined in [!:Autodesk::Revit::UI::ITemporaryGraphicsHandler::OnClick(TemporaryGraphicsCommandData)]. The caller can use the returned index to update the control (changing image/location), delete and change visibility (hide/unhide) in response to any events later.
See Also
Reference
TemporaryGraphicsManager Class
Autodesk.Revit.DB Namespace